# SQL Basic

## Step 1 : Installing Dependencies

In [1]:
!pip install sqlalchemy==1.3.9 ipython-sql

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\pranit\appdata\roaming\python\python39\site-packages (1.3.9)
Requirement already satisfied: ipython-sql in c:\users\pranit\appdata\roaming\python\python39\site-packages (0.4.1)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\pranit\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: prettytable<1 in c:\users\pranit\appdata\roaming\python\python39\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: setuptools>=18.5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: traitlets>=5 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: decorator in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pickleshare in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: stack-data in c:\programdata\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\programdata\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in c:\programdata\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\programdata\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\programdata\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)

# Restart and run all in Kernel
     Kernel ---> Restart and Run All

In [2]:
%load_ext sql

In [3]:
import csv , sqlite3
con = sqlite3.connect("basics.db")
cur = con.cursor()

In [4]:
%sql sqlite:///basics.db

# Start perfoming SQL operations

# Syntax for creating a table
~~~sql
CREATE TABLE "table name"
    (column1 datatype1,
    column2 datatype2,
    column3 datatype3):
~~~

# Example : Create table "users" with below columns

id
name
age
email

In [7]:
%%sql
CREATE TABLE users
   (id int,
    name varchar(20),
    age int,
    email varchar(50));

 * sqlite:///basics.db
Done.

[]

# To View your table use SELECT Query
        SELECT ColumnNames from TableName
For seeing all columns use * symbol

In [8]:
%%sql
SELECT * from users

 * sqlite:///basics.db
Done.

[]

# Inserting data into colums
~~~sql
INSERT INTO table name
VALUES (col1data , col2data , col3data....);
~~~

In [9]:
%%sql
INSERT INTO users
VALUES (1,"pranit",25,"ithapepranit8@gmail.com");

 * sqlite:///basics.db
1 rows affected.

[]

In [10]:
%%sql
SELECT * from users

 * sqlite:///basics.db
Done.

[(1, 'pranit', 25, 'ithapepranit8@gmail.com')]

# Adding multiple data using INSERT Query
~~~sql
INSERT INTO Tablename
VALUES (col1data,col2data , col3data ,col4data),
       (col1data,col2data , col3data ,col4data),
       (col1data,col2data , col3data ,col4data),
       (col1data,col2data , col3data ,col4data);
~~~

In [11]:
%%sql
INSERT INTO users
VALUES (2, "sona",22,"sona@gmail.com"),
       (3, "xyz",34,"asv@gmail.com"),
       (4, "bcg",88,"dfg@gmail.com");

 * sqlite:///basics.db
3 rows affected.

[]

In [12]:
%%sql
SELECT * FROM users

 * sqlite:///basics.db
Done.

[(1, 'pranit', 25, 'ithapepranit8@gmail.com'),
 (2, 'sona', 22, 'sona@gmail.com'),
 (3, 'xyz', 34, 'asv@gmail.com'),
 (4, 'bcg', 88, 'dfg@gmail.com')]

# SESSION 2 : Table Constraints

In [13]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [14]:
import csv , sqlite3
con  = sqlite3.connect("my_data.db")
cur = con.cursor()

In [16]:
%sql sqlite:///my_data.db

# SQL Queries can now be executed in python

# Deprtment Table creation with Constraints

In [17]:
%%sql
CREATE TABLE Department
   (departmentID INT PRIMARY KEY NOT NULL,
    DepartmentName VARCHAR(50) NOT NULL);

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[]

In [18]:
%%sql
SELECT * FROM Department

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[]

In [23]:
%%sql
SELECT * FROM Department

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'ajay')]

In [25]:
%%sql
INSERT INTO Department
VALUES (2,"SALES");

   sqlite:///basics.db
 * sqlite:///my_data.db
1 rows affected.

[]

In [26]:
%%sql
SELECT * FROM Department

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'ajay'), (2, 'SALES')]

In [27]:
%%sql
INSERT INTO Department
VALUES(3,'Accounts')

   sqlite:///basics.db
 * sqlite:///my_data.db
1 rows affected.

[]

In [28]:
%%sql
SELECT * FROM Department

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'ajay'), (2, 'SALES'), (3, 'Accounts')]

In [29]:
%%sql 
INSERT INTO Department
VALUES (5, NULL)

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Department.DepartmentName
[SQL: INSERT INTO Department
VALUES (5, NULL)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [30]:
%%sql                                    # null values are not added
SELECT * FROM Department

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'ajay'), (2, 'SALES'), (3, 'Accounts')]

# Creating Employee Data table
    Employee ID
    FirstName
    LastName
    Email
    DepartmentID
    Salary
    Hiring Date

In [31]:
%%sql
CREATE TABLE Employee
     (EmployeeID INT PRIMARY KEY NOT NULL,
      FirstName VARCHAR(50) NOT NULL,
      LastName VARCHAR(50) NOT NULL,
      Email VARCHAR(100) UNIQUE,
      DepartmentId INT,
      Salary INT CHECK(Salary>0),
      constraint fk_departmentID
      foreign key(DepartmentID)
      References Department(departmentID));

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[]

In [32]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[]

In [33]:
%%sql 
INSERT INTO Employee
VALUES (1,'Utkarsh','Gaikwad','utkarsh.etlhive@gmail.com',3,25000),
       (2,'Sarthak','Sharma','test@test.com',1,20000),
       (3,'Sayali','More','example@gmail.com',2,30000),
       (4,'Raman','Verma','raman@gmail.com',4,40000);

   sqlite:///basics.db
 * sqlite:///my_data.db
4 rows affected.

[]

In [34]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

# Trying to insert Repeated EmployeeID

In [35]:
%%sql                                                                   # primary key constraint
INSERT INTO Employee
VALUES (2,"asd","dfg","sgdg@gmail.com",3,333333);

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Employee.EmployeeID
[SQL: INSERT INTO Employee
VALUES (2,"asd","dfg","sgdg@gmail.com",3,333333);]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [36]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

In [37]:
%%sql                                 # not null constraint
INSERT INTO Employee
VALUES (5,Null,'Doe','johndoe@gmail.com',1,27000)

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.IntegrityError) NOT NULL constraint failed: Employee.FirstName
[SQL: INSERT INTO Employee
VALUES (5,Null,'Doe','johndoe@gmail.com',1,27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [38]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

In [39]:
%%sql                               #not null constraint
INSERT INTO Employee
VALUES (5,'John',Null,'johndoe@gmail.com',1,27000)

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.OperationalError) near "#not": syntax error
[SQL: #not null constraint
INSERT INTO Employee
VALUES (5,'John',Null,'johndoe@gmail.com',1,27000)]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [40]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

In [41]:
%%sql                                   # unique constraint
INSERT INTO Employee
VALUES (5,'John','Doe','test@test.com',1,27000)

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.IntegrityError) UNIQUE constraint failed: Employee.Email
[SQL: INSERT INTO Employee
VALUES (5,'John','Doe','test@test.com',1,27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [42]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

In [43]:
%%sql                       # check constraint
INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,-27000)

   sqlite:///basics.db
 * sqlite:///my_data.db
(sqlite3.IntegrityError) CHECK constraint failed: Salary>0
[SQL: INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,-27000)]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [44]:
%%sql
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000)]

In [45]:
%%sql 
INSERT INTO Employee
VALUES (5,'John','Doe','johndoe@test.com',1,27000)

   sqlite:///basics.db
 * sqlite:///my_data.db
1 rows affected.

[]

In [46]:
%%sql                                   # department id foreign key constraint work as a joint
SELECT * FROM Employee

   sqlite:///basics.db
 * sqlite:///my_data.db
Done.

[(1, 'Utkarsh', 'Gaikwad', 'utkarsh.etlhive@gmail.com', 3, 25000),
 (2, 'Sarthak', 'Sharma', 'test@test.com', 1, 20000),
 (3, 'Sayali', 'More', 'example@gmail.com', 2, 30000),
 (4, 'Raman', 'Verma', 'raman@gmail.com', 4, 40000),
 (5, 'John', 'Doe', 'johndoe@test.com', 1, 27000)]

# Close the connection in END

In [47]:
con.close()